; domain
; Source: https://github.com/AI-Planning/pddl-generators/tree/main/miconic
; Fix: prevent the elevator from boarding served passengers => (not (origin ?p ?f)) effect added to board action
(define (domain miconic)
  (:requirements :strips :typing)
  (:types passenger - object
          floor - object
         )

(:predicates 
(origin ?person - passenger ?floor - floor)
;; entry of ?person is ?floor
;; inertia

(destin ?person - passenger ?floor - floor)
;; exit of ?person is ?floor
;; inertia

(above ?floor1 - floor  ?floor2 - floor)
;; ?floor2 is located above of ?floor1

(boarded ?person - passenger)
;; true if ?person has boarded the lift

(served ?person - passenger)
;; true if ?person has alighted as her destination

(lift-at ?floor - floor)
;; current position of the lift is at ?floor
)


;;stop and allow boarding

(:action board
  :parameters (?f - floor ?p - passenger)
  :precondition (and (lift-at ?f) (origin ?p ?f))
  :effect (and (boarded ?p) (not (origin ?p ?f))))

(:action depart
  :parameters (?f - floor ?p - passenger)
  :precondition (and (lift-at ?f) (destin ?p ?f)
		     (boarded ?p))
  :effect (and (not (boarded ?p))
	       (served ?p)))
;;drive up

(:action up
  :parameters (?f1 - floor ?f2 - floor)
  :precondition (and (lift-at ?f1) (above ?f1 ?f2))
  :effect (and (lift-at ?f2) (not (lift-at ?f1))))


;;drive down

(:action down
  :parameters (?f1 - floor ?f2 - floor)
  :precondition (and (lift-at ?f1) (above ?f2 ?f1))
  :effect (and (lift-at ?f2) (not (lift-at ?f1))))
)

; problem
;; passengers=7, floors=15, out_folder=training/easy, instance_id=70, seed=97

(define (problem miconic-70)
 (:domain miconic)
 (:objects 
    p1 p2 p3 p4 p5 p6 p7 - passenger
    f1 f2 f3 f4 f5 f6 f7 f8 f9 f10 f11 f12 f13 f14 f15 - floor
    )
 (:init 
    (lift-at f4)
    (origin p1 f7)
    (destin p1 f14)
    (origin p2 f6)
    (destin p2 f15)
    (origin p3 f14)
    (destin p3 f13)
    (origin p4 f1)
    (destin p4 f11)
    (origin p5 f1)
    (destin p5 f10)
    (origin p6 f13)
    (destin p6 f1)
    (origin p7 f1)
    (destin p7 f13)
    (above f1 f2)
    (above f1 f3)
    (above f1 f4)
    (above f1 f5)
    (above f1 f6)
    (above f1 f7)
    (above f1 f8)
    (above f1 f9)
    (above f1 f10)
    (above f1 f11)
    (above f1 f12)
    (above f1 f13)
    (above f1 f14)
    (above f1 f15)
    (above f2 f3)
    (above f2 f4)
    (above f2 f5)
    (above f2 f6)
    (above f2 f7)
    (above f2 f8)
    (above f2 f9)
    (above f2 f10)
    (above f2 f11)
    (above f2 f12)
    (above f2 f13)
    (above f2 f14)
    (above f2 f15)
    (above f3 f4)
    (above f3 f5)
    (above f3 f6)
    (above f3 f7)
    (above f3 f8)
    (above f3 f9)
    (above f3 f10)
    (above f3 f11)
    (above f3 f12)
    (above f3 f13)
    (above f3 f14)
    (above f3 f15)
    (above f4 f5)
    (above f4 f6)
    (above f4 f7)
    (above f4 f8)
    (above f4 f9)
    (above f4 f10)
    (above f4 f11)
    (above f4 f12)
    (above f4 f13)
    (above f4 f14)
    (above f4 f15)
    (above f5 f6)
    (above f5 f7)
    (above f5 f8)
    (above f5 f9)
    (above f5 f10)
    (above f5 f11)
    (above f5 f12)
    (above f5 f13)
    (above f5 f14)
    (above f5 f15)
    (above f6 f7)
    (above f6 f8)
    (above f6 f9)
    (above f6 f10)
    (above f6 f11)
    (above f6 f12)
    (above f6 f13)
    (above f6 f14)
    (above f6 f15)
    (above f7 f8)
    (above f7 f9)
    (above f7 f10)
    (above f7 f11)
    (above f7 f12)
    (above f7 f13)
    (above f7 f14)
    (above f7 f15)
    (above f8 f9)
    (above f8 f10)
    (above f8 f11)
    (above f8 f12)
    (above f8 f13)
    (above f8 f14)
    (above f8 f15)
    (above f9 f10)
    (above f9 f11)
    (above f9 f12)
    (above f9 f13)
    (above f9 f14)
    (above f9 f15)
    (above f10 f11)
    (above f10 f12)
    (above f10 f13)
    (above f10 f14)
    (above f10 f15)
    (above f11 f12)
    (above f11 f13)
    (above f11 f14)
    (above f11 f15)
    (above f12 f13)
    (above f12 f14)
    (above f12 f15)
    (above f13 f14)
    (above f13 f15)
    (above f14 f15)
)
 (:goal  (and (served p1)
   (served p2)
   (served p3)
   (served p4)
   (served p5)
   (served p6)
   (served p7))))

; plan
1. (up f4 f6)
   deleted: (lift-at f4)
   added: (lift-at f6)
   goals met: 0 of 7
2. (board f6 p2)
   deleted: (origin p2 f6)
   added: (boarded p2)
   goals met: 0 of 7
3. (up f6 f15)
   deleted: (lift-at f6)
   added: (lift-at f15)
   goals met: 0 of 7
4. (depart f15 p2)
   deleted: (boarded p2)
   added: (served p2)
   goals met: 1 of 7
5. (down f15 f7)
   deleted: (lift-at f15)
   added: (lift-at f7)
   goals met: 1 of 7
6. (board f7 p1)
   deleted: (origin p1 f7)
   added: (boarded p1)
   goals met: 1 of 7
7. (up f7 f14)
   deleted: (lift-at f7)
   added: (lift-at f14)
   goals met: 1 of 7
8. (board f14 p3)
   deleted: (origin p3 f14)
   added: (boarded p3)
   goals met: 1 of 7
9. (depart f14 p1)
   deleted: (boarded p1)
   added: (served p1)
   goals met: 2 of 7
10. (down f14 f1)
   deleted: (lift-at f14)
   added: (lift-at f1)
   goals met: 2 of 7
11. (board f1 p7)
   deleted: (origin p7 f1)
   added: (boarded p7)
   goals met: 2 of 7
12. (board f1 p5)
   deleted: (origin p5 f1)
   added: (boarded p5)
   goals met: 2 of 7
13. (board f1 p4)
   deleted: (origin p4 f1)
   added: (boarded p4)
   goals met: 2 of 7
14. (up f1 f10)
   deleted: (lift-at f1)
   added: (lift-at f10)
   goals met: 2 of 7
15. (depart f10 p5)
   deleted: (boarded p5)
   added: (served p5)
   goals met: 3 of 7
16. (up f10 f11)
   deleted: (lift-at f10)
   added: (lift-at f11)
   goals met: 3 of 7
17. (depart f11 p4)
   deleted: (boarded p4)
   added: (served p4)
   goals met: 4 of 7
18. (up f11 f13)
   deleted: (lift-at f11)
   added: (lift-at f13)
   goals met: 4 of 7
19. (depart f13 p7)
   deleted: (boarded p7)
   added: (served p7)
   goals met: 5 of 7
20. (board f13 p6)
   deleted: (origin p6 f13)
   added: (boarded p6)
   goals met: 5 of 7
21. (depart f13 p3)
   deleted: (boarded p3)
   added: (served p3)
   goals met: 6 of 7
22. (down f13 f1)
   deleted: (lift-at f13)
   added: (lift-at f1)
   goals met: 6 of 7
23. (depart f1 p6)
   deleted: (boarded p6)
   added: (served p6)
   goals met: 7 of 7
